# Quartis
Dados agrupados

In [14]:
import numpy as np
import pandas as pd

In [13]:
dados = {'inferior': [150, 154, 158, 162, 166, 170],
         'superior': [154, 158, 162, 166, 170, 174],
         'fi': [5, 9, 11, 7, 5, 3]}

In [15]:
df = pd.DataFrame(dados)
df

   inferior  superior  fi
0       150       154   5
1       154       158   9
2       158       162  11
3       162       166   7
4       166       170   5
5       170       174   3

In [16]:
df['xi'] = (df['superior'] + df['inferior']) / 2
df

   inferior  superior  fi     xi
0       150       154   5  152.0
1       154       158   9  156.0
2       158       162  11  160.0
3       162       166   7  164.0
4       166       170   5  168.0
5       170       174   3  172.0

In [17]:
df['fi.xi'] = df['fi'] * df['xi']
df

   inferior  superior  fi     xi   fi.xi
0       150       154   5  152.0   760.0
1       154       158   9  156.0  1404.0
2       158       162  11  160.0  1760.0
3       162       166   7  164.0  1148.0
4       166       170   5  168.0   840.0
5       170       174   3  172.0   516.0

In [18]:
df['Fi'] = 0
df

   inferior  superior  fi     xi   fi.xi  Fi
0       150       154   5  152.0   760.0   0
1       154       158   9  156.0  1404.0   0
2       158       162  11  160.0  1760.0   0
3       162       166   7  164.0  1148.0   0
4       166       170   5  168.0   840.0   0
5       170       174   3  172.0   516.0   0

In [19]:
frequencia_acumulada = []
somatorio = 0

for linha in df.iterrows():
    # print(linha[1][2])
    
    somatorio += linha[1][2]
    frequencia_acumulada.append(somatorio)

In [20]:
frequencia_acumulada

[5.0, 14.0, 25.0, 32.0, 37.0, 40.0]

In [21]:
df['Fi'] = frequencia_acumulada
df

   inferior  superior  fi     xi   fi.xi    Fi
0       150       154   5  152.0   760.0   5.0
1       154       158   9  156.0  1404.0  14.0
2       158       162  11  160.0  1760.0  25.0
3       162       166   7  164.0  1148.0  32.0
4       166       170   5  168.0   840.0  37.0
5       170       174   3  172.0   516.0  40.0

In [28]:
 def get_quartil(dataframe, q1=True):
        if q1 == True:
            fi_4 = dataframe['fi'].sum() / 4
        else:
            fi_4 = (3 * dataframe['fi'].sum()) / 4
            
        limite_inferior, frequencia_classe, id_frequencia_anterior = 0, 0, 0
        
        for linha in dataframe.iterrows():
            limite_inferior = linha[1][0]
            frequencia_classe = linha[1][2]
            id_frequencia_anterior = linha[0]
            
            if linha[1][5] >= fi_4:
                id_frequencia_anterior -= 1
                break
                
        Fi_anterior = dataframe.iloc[[id_frequencia_anterior]]['Fi'].values[0]
        q = limite_inferior + ((fi_4 - Fi_anterior) * 4) / frequencia_classe

        return q

In [29]:
get_quartil(df)

156.22222222222223

In [30]:
get_quartil(df, q1=False)

164.85714285714286